# IsParameterLocked Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyManager..::..IsParameterLocked Method
FamilyManager Class See Also
---
For Conceptual Mass and Curtain Panel families, indicate whether the specified dimension-driving parameter is locked.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsParameterLocked(
	FamilyParameter familyParameter
)
```

Visual Basic
---
```text
Public Function IsParameterLocked ( _
	familyParameter As FamilyParameter _
) As Boolean
```

Visual C++
---
```text
public:
bool IsParameterLocked(
	FamilyParameter^ familyParameter
)
```

# ### Parameters
familyParameter
    Type: Autodesk.Revit.DB..::..FamilyParameter
# ### Return Value
True if the parameter is lockable and is locked; false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown if this family is not a Conceptual Mass or Curtain Panel family. |

# See Also
FamilyManager Class
Autodesk.Revit.DB Namespace